bolknote/MK61S_MINI/code/tools.cpp
bool OpenStoredFile(const char* args) {
  program_store::Entry entry;
  if(!ResolveStoredFile(args, entry)) return false;
  return OpenStoredEntry(entry);
}

static const SoundNote* sound_sequence = NULL;
static usize sound_sequence_len = 0;
static usize sound_sequence_index = 0;
static usize sound_sequence_pin = PIN_BUZZER;
static t_time_ms sound_sequence_next_at = 0;

static void sound_sequence_cancel(void) {
  sound_sequence = NULL;
  sound_sequence_len = 0;
  sound_sequence_index = 0;
}

static void sound_sequence_start(const SoundNote* sequence, usize len, usize pin) {
  sound_sequence = sequence;
  sound_sequence_len = len;
  sound_sequence_index = 0;
  sound_sequence_pin = pin;
  sound_sequence_next_at = millis();
}

static void sound_sequence_poll(void) {
  const t_time_ms now = millis();
  if(sound_sequence == NULL || (i32) (now - sound_sequence_next_at) < 0) {
    return;
  }

  if(sound_sequence_index >= sound_sequence_len) {
    sound_sequence_cancel();
    return;
  }

  const SoundNote note = sound_sequence[sound_sequence_index++];
  const usize volume = library_mk61::sound_volume();
  if(note.frequency_Hz > 0 && note.duration_ms > 0 && volume > 0) {
    sound_driver_play_scaled(sound_sequence_pin, note.frequency_Hz, note.duration_ms, volume, note.volume_percent);
  }
  sound_sequence_next_at = now + note.duration_ms + note.gap_ms;
}

static bool opcode_needs_expanded_memory(u8 opcode) {
  return opcode == MK61_STORE_REGISTER_F || opcode == MK61_LOAD_REGISTER_F;
}

bool program_needs_expanded_memory(const u8* code_page, usize code_len) {
  const usize bounded_len = (code_len > core_61::MAX_PROGRAM_STEP) ? core_61::MAX_PROGRAM_STEP : code_len;

  for(usize i = core_61::CLASSIC_PROGRAM_STEP; i < bounded_len; i++) {
    if(code_page[i] != 0) return true;
  }

  for(usize i = 0; i < bounded_len;) {
    const u8 opcode = code_page[i];
    if(opcode_needs_expanded_memory(opcode)) return true;
    const usize opcode_len = core_61::len_code_command(opcode);
    i += (opcode_len == 0) ? 1 : opcode_len;
  }

  return false;
}

void apply_program_memory_auto(const u8* code_page, usize code_len, bool preserve_program, bool force_expanded) {
  const bool enable_expanded = force_expanded || program_needs_expanded_memory(code_page, code_len);
  if(library_mk61::expanded_program_is_on() == enable_expanded) return;

  u8 saved_code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
  if(preserve_program) core_61::get_code_page(&saved_code_page[0]);

  library_mk61::set_program_memory_state(enable_expanded);
  library_mk61::refresh_menu_text();
  library_mk61::store_settings_state();
  reset_ext_program_state();
  core_61::enable();

  if(preserve_program) core_61::set_code_page(&saved_code_page[0]);
}

void ensure_program_memory_for_write(usize linear_addr, u8 opcode) {
  const bool force_expanded = linear_addr >= core_61::CLASSIC_PROGRAM_STEP || opcode_needs_expanded_memory(opcode);
  if(force_expanded) apply_program_memory_auto(NULL, 0, true, true);
}

void DFU_enable(void) {
    void (*SysMemBootJump)(void);

  lcd.clear();
  library_mk61::print_localized_at(0, 0, "Прошивка DFU", " DFU flash mode!");
    __enable_irq();
    HAL_RCC_DeInit();
    HAL_DeInit();
    SysTick->CTRL = 0; SysTick->LOAD = 0; SysTick->VAL = 0;
    __HAL_SYSCFG_REMAPMEMORY_SYSTEMFLASH();

    const uint32_t p = (*((uint32_t *) 0x1FFF0000));
    __set_MSP( p );

    SysMemBootJump = (void (*)(void)) (*((uint32_t *) 0x1FFF0004));
    SysMemBootJump();

  while(true) {};
 
}

bool  Confirmation(void) {
  extern void lcd_std_display_redraw(void);

  {
    MK61DisplayUpdate update(lcd);
    lcd.setCursor(0,0); lcd.print(library_mk61::text("press OK confirm", "OK \001O\003TBEP\003"));
  }
  i32 key = kbd::get_key_wait();
  lcd_std_display_redraw();

  return (key == KEY_OK);
}

void sound_poll(void) {
  sound_driver_poll();
  sound_sequence_poll();
}

void delay_with_sound_poll(t_time_ms duration_ms) {
  const t_time_ms stop_at = millis() + duration_ms;
  do {
    sound_poll();
    delay(1);
  } while((i32) (millis() - stop_at) < 0);
  sound_poll();
}

void sound_scaled(usize pin, isize freq_Hz, usize duration_ms, usize volume, usize volume_percent) {
  sound_sequence_cancel();
  sound_driver_play_scaled(pin, freq_Hz, duration_ms, volume, volume_percent);
}

void  sound(usize pin, isize freq_Hz, usize duration_ms, usize volume) {
  sound_scaled(pin, freq_Hz, duration_ms, volume, 100);
}

void  sound_stop(void) {
  sound_sequence_cancel();
  sound_driver_stop();
}

void sound_startup(void) {
  sound_sequence_start(STARTUP_JINGLE, sizeof(STARTUP_JINGLE) / sizeof(STARTUP_JINGLE[0]), PIN_BUZZER);
}

// Паттерн из терминала копируется в свой буфер: строка ввода не переживает
// асинхронное воспроизведение.
static SoundNote user_pattern[SOUND_PATTERN_MAX];

bool sound_pattern_start(const SoundNote* notes, usize count) {
  if(notes == NULL || count == 0 || count > SOUND_PATTERN_MAX) return false;
  sound_stop();
  for(usize i = 0; i < count; i++) user_pattern[i] = notes[i];
  sound_sequence_start(user_pattern, count, PIN_BUZZER);
  return true;
}

void message_and_waitkey(const char* lcd_message) {
  led::on();
  {
    MK61DisplayUpdate update(lcd);
    lcd.setCursor(0, 1); lcd.print(lcd_message);
  }
  kbd::get_key_wait();
  led::off();
}

// Вставка команды opcode, в программу mk61s с шага step, с коррекцией команд с переходом по адресу перехода
void  insert_cmd_in_program(usize into_step, usize opcode) {
  u8 code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};

  dbgln(MINI, "Insert comand <", opcode, "> in program step ", into_step);
  
  core_61::get_code_page(&code_page[0]);

  bool  inc_operand = false;
  u8    move_code, copy_code = opcode;

  const usize program_steps = core_61::program_steps();
  for(usize i = into_step; i < program_steps; i++) {
    move_code = code_page[i];

    if(inc_operand) {
      // необходима коррекция операнда предыдущей команды
      if(copy_code >= into_step) copy_code++;
      inc_operand = false;
    } else { // рассматриваемое данное это команда, не операнд!
      if(core_61::len_code_command(copy_code) == 2) { 
      // установить необходимость коррекция второго операнда команды (адреса перехода)
        dbgln(MINI, "Step ", i, " 2 operand opcode: ", copy_code);
        inc_operand = true;
      }
    }
    code_page[i] = copy_code;
    copy_code = move_code;
  }
  core_61::set_code_page(code_page);
}

SPIFlash  flash(PIN_SPIFLASH_CS);
bool      flash_is_ok;

static constexpr u32 SETTINGS_FLASH_SECTOR = (MAX_SLOT_FOR_PROGRAM + 2) * FLASH_SECTOR_SIZE;
static constexpr u32 LEGACY_EEPROM_PAGE_SIZE = 8 * 1024;

struct PersistentSettings {
  u8 grade;
  u8 counter;
  u8 flags;
  u8 sound;
  lcd_display::TextProfile text_profile;
  bool text_profile_stored;
};

static PersistentSettings persistent_settings = {
  0xFF,
  0,
  0xFF,
  0xFF,
  lcd_display::defaultTextProfileForRows(lcd_display::DEFAULT_ROWS),
  false
};
static bool persistent_settings_loaded = false;
static bool persistent_settings_sector_dirty = false;
static bool persistent_settings_needs_save = false;
static bool persistent_settings_write_blocked = false;
static u32 persistent_settings_next_address = SETTINGS_FLASH_SECTOR;

